class AppModel{
  static List<String> souraName =["الفاتحة","البقرة","آل عمران","النساء","المائدة","الأنعام","الأعراف","الأنفال","التوبة","يونس","هود"
    ,"يوسف","الرعد","إبراهيم","الحجر","النحل","الإسراء","الكهف","مريم","طه","الأنبياء","الحج","المؤمنون"
    ,"النّور","الفرقان","الشعراء","النّمل","القصص","العنكبوت","الرّوم","لقمان","السجدة","الأحزاب","سبأ"
    ,"فاطر","يس","الصافات","ص","الزمر","غافر","فصّلت","الشورى","الزخرف","الدّخان","الجاثية","الأحقاف"
    ,"محمد","الفتح","الحجرات","ق","الذاريات","الطور","النجم","القمر","الرحمن","الواقعة","الحديد","المجادلة"
    ,"الحشر","الممتحنة","الصف","الجمعة","المنافقون","التغابن","الطلاق","التحريم","الملك","القلم","الحاقة","المعارج"
    ,"نوح","الجن","المزّمّل","المدّثر","القيامة","الإنسان","المرسلات","النبأ","النازعات","عبس","التكوير","الإنفطار"
    ,"المطفّفين","الإنشقاق","البروج","الطارق","الأعلى","الغاشية","الفجر","البلد","الشمس","الليل","الضحى","الشرح"
    ,"التين","العلق","القدر","البينة","الزلزلة","العاديات","القارعة","التكاثر","العصر",
    "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون","النصر","المسد","الإخلاص","الفلق","الناس"];

  static List<String> numberOfVerses = [
    "7",   // سورة الفاتحة
    "286", // سورة البقرة
    "200", // سورة آل عمران
    "176", // سورة النساء
    "120", // سورة المائدة
    "165", // سورة الأنعام
    "206", // سورة الأعراف
    "75",  // سورة الأنفال
    "129", // سورة التوبة
    "109", // سورة يونس
    "123", // سورة هود
    "111", // سورة يوسف
    "43",  // سورة الرعد
    "52",  // سورة إبراهيم
    "99",  // سورة الحجر
    "128", // سورة النحل
    "111", // سورة الإسراء
    "110", // سورة الكهف
    "98",  // سورة مريم
    "135", // سورة طه
    "112", // سورة الأنبياء
    "78",  // سورة الحج
    "118", // سورة المؤمنون
    "64",  // سورة النور
    "77",  // سورة الفرقان
    "227", // سورة الشعراء
    "93",  // سورة النمل
    "88",  // سورة القصص
    "69",  // سورة العنكبوت
    "60",  // سورة الروم
    "34",  // سورة لقمان
    "30",  // سورة السجدة
    "73",  // سورة الأحزاب
    "54",  // سورة سبأ
    "45",  // سورة فاطر
    "83",  // سورة يس
    "182", // سورة الصافات
    "88",  // سورة ص
    "75",  // سورة الزمر
    "85",  // سورة غافر
    "54",  // سورة فصلت
    "53",  // سورة الشورى
    "89",  // سورة الزخرف
    "59",  // سورة الدخان
    "37",  // سورة الجاثية
    "35",  // سورة الأحقاف
    "38",  // سورة محمد
    "29",  // سورة الفتح
    "18",  // سورة الحجرات
    "45",  // سورة ق
    "60",  // سورة الذاريات
    "49",  // سورة الطور
    "62",  // سورة النجم
    "55",  // سورة القمر
    "78",  // سورة الرحمن
    "96",  // سورة الواقعة
    "29",  // سورة الحديد
    "22",  // سورة المجادلة
    "24",  // سورة الحشر
    "13",  // سورة الممتحنة
    "14",  // سورة الصف
    "11",  // سورة الجمعة
    "11",  // سورة المنافقون
    "18",  // سورة التغابن
    "12",  // سورة الطلاق
    "12",  // سورة التحريم
    "30",  // سورة الملك
    "52",  // سورة القلم
    "52",  // سورة الحاقة
    "44",  // سورة المعارج
    "28",  // سورة نوح
    "28",  // سورة الجن
    "20",  // سورة المزمل
    "56",  // سورة المدثر
    "40",  // سورة القيامة
    "31",  // سورة الإنسان
    "50",  // سورة المرسلات
    "40",  // سورة النبأ
    "46",  // سورة النازعات
    "42",  // سورة عبس
    "29",  // سورة التكوير
    "19",  // سورة الانفطار
    "36",  // سورة المطففين
    "25",  // سورة الإنشقاق
    "22",  // سورة البروج
    "17",  // سورة الطارق
    "19",  // سورة الأعلى
    "26",  // سورة الغاشية
    "30",  // سورة الفجر
    "20",  // سورة البلد
    "15",  // سورة الشمس
    "21",  // سورة الليل
    "11",  // سورة الضحى
    "8",   // سورة الشرح
    "8",   // سورة التين
    "19",  // سورة العلق
    "5",   // سورة القدر
    "8",   // سورة البينة
    "8",   // سورة الزلزلة
    "11",  // سورة العاديات
    "11",  // سورة القارعة
    "8",   // سورة التكاثر
    "3",   // سورة العصر
    "9",   // سورة الهمزة
    "5",   // سورة الفيل
    "4",   // سورة قريش
    "7",   // سورة الماعون
    "3",   // سورة الكوثر
    "6",   // سورة الكافرون
    "3",   // سورة النصر
    "5",   // سورة المسد
    "4",   // سورة الإخلاص
    "5",   // سورة الفلق
    "6",   // سورة الناس
  ];






}